In [70]:
'''
Day 3 -Pandas
'''
import pandas as pd
import numpy as np

In [71]:
#create dataframe
data = {
    'Name': ['Sid', 'Bob', 'Random'],
    'Age': [25, 30, 35],
    'City': ['Bengaluru', 'Los Angeles', 'Chicago'],
    'Speed': [100,np.nan, 21]
}
df = pd.DataFrame(data)
df

     Name  Age         City  Speed
0     Sid   25    Bengaluru  100.0
1     Bob   30  Los Angeles    NaN
2  Random   35      Chicago   21.0

In [72]:
#from csv
df_csv= pd.read_csv("Datasets/Data.csv")
df_csv

   Id   A   B   C   D
0   1   0   1   2   3
1   2   4   5   6   7
2   3   8   9  10  11
3   4  12  13  14  15
4   5  16  17  18  19

In [73]:
df[["Name","City"]]

     Name         City
0     Sid    Bengaluru
1     Bob  Los Angeles
2  Random      Chicago

In [74]:
df.loc[1]

Name             Bob
Age               30
City     Los Angeles
Speed            NaN
Name: 1, dtype: object

In [75]:
df.iloc[1]

Name             Bob
Age               30
City     Los Angeles
Speed            NaN
Name: 1, dtype: object

In [76]:
#fill na values with 0
df.fillna(0)

     Name  Age         City  Speed
0     Sid   25    Bengaluru  100.0
1     Bob   30  Los Angeles    0.0
2  Random   35      Chicago   21.0

In [99]:
df["Age"]= df["Age"].astype(int)

In [78]:
df["Age"].dtype

dtype('int64')

In [79]:
df['Salary'] = [50000, 60000, 70000]
df

     Name  Age         City  Speed  Salary
0     Sid   25    Bengaluru  100.0   50000
1     Bob   30  Los Angeles    NaN   60000
2  Random   35      Chicago   21.0   70000

In [80]:
df.drop("Salary",axis=1, inplace=True)
df

     Name  Age         City  Speed
0     Sid   25    Bengaluru  100.0
1     Bob   30  Los Angeles    NaN
2  Random   35      Chicago   21.0

In [81]:
df = df.rename(columns={'Name': 'Student Name'})
print(df)

  Student Name  Age         City  Speed
0          Sid   25    Bengaluru  100.0
1          Bob   30  Los Angeles    NaN
2       Random   35      Chicago   21.0

In [83]:
df['Salary'] = [50000, 60000, 70000]
df['Sex']= ["M","F","M"]

In [84]:
df

  Student Name  Age         City  Speed  Salary Sex
0          Sid   25    Bengaluru  100.0   50000   M
1          Bob   30  Los Angeles    NaN   60000   F
2       Random   35      Chicago   21.0   70000   M

In [104]:
df.groupby("Sex")["Age"].mean()

Sex
F    30.0
M    30.0
Name: Age, dtype: float64

In [ ]:
df.to_csv('data.csv', index=False)